Ret395/bulk/kOmegaSST/kays2/Pr1/mesh4/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)                    Gauss linearUpwind grad(U); // Gauss linearUpwind grad(U);
    div(phi,K)                    Gauss upwind;
    div(phi,k)                    Gauss upwind;
    div(phi,h)                    Gauss upwind;
    div(phi,epsilon)              Gauss upwind;
    div(phi,omega)                Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
//    laplacian(alphaEB) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}


wallDist
{
    method meshWave;
}
// ************************************************************************* //
